cases/rising_bubble/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       9440;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       9560;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       9680;
    }
    atmosphere
    {
        type            patch;
        nFaces          40;
        startFace       9720;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       9760;
    }
)

// ************************************************************************* //
